** 1.1

*** Exercise 1-1

Run the "hello, world" program on your system. Experiment with leaving out parts of the programs, to see what error messages you get.

#+begin_src C
  #include <stdio.h>

  int main() {
    printf("hello, world\n");
  }
#+end_src

#+RESULTS:
| hello | world |

*** Exercise 1-2

Experiment to find out what happens when ~printf~'s argument string contains ~\c~, where ~c~ is some character not listed above.

#+begin_src C
  #include <stdio.h>

  int main() {
    printf("\y");
  }
#+end_src

#+RESULTS:
: y

** 1.2


*** Exercise 1-3

Modify the temperature conversion prgoram to print a heading above the table

#+begin_src C
  #include <stdio.h>
  
  /* print Fahreheit-Celsius table
     for fahr = 0, 20, ..., 300; floating-point version */

  int main()
  {
    float fahr, celsius;
    int lower, upper, step;

    lower = 0;   /* lower limit of temperature table */
    upper = 300; /* upper limit */
    step = 20;   /* step size */

    fahr = lower;
    printf("Fahrenheit celsius\n");
    while (fahr <= upper) {
      celsius= (5.0/9.0) * (fahr-32.0);
      printf("%3.0f %6.1f\n", fahr, celsius);
      fahr = fahr + step;
    }
  }
#+end_src

#+RESULTS:
| Fahrenheit | celsius |
|          0 |   -17.8 |
|         20 |    -6.7 |
|         40 |     4.4 |
|         60 |    15.6 |
|         80 |    26.7 |
|        100 |    37.8 |
|        120 |    48.9 |
|        140 |    60.0 |
|        160 |    71.1 |
|        180 |    82.2 |
|        200 |    93.3 |
|        220 |   104.4 |
|        240 |   115.6 |
|        260 |   126.7 |
|        280 |   137.8 |
|        300 |   148.9 |


*** Exercise 1-4

Write a program to print the corresponding Celsius to Fahrenheit table.


#+begin_src C
  #include <stdio.h>
  
  /* print Fahreheit-Celsius table
     for fahr = 0, 20, ..., 300; floating-point version */

  int main()
  {
    float fahr, celsius;
    int lower, upper, step;

    lower = 0;   /* lower limit of temperature table */
    upper = 100; /* upper limit */
    step = 10;   /* step size */

    celsius = lower;
    printf("Fahrenheit celsius\n");
    while (celsius <= upper) {
      fahr= (celsius * (9.0/5.0)) + 32;
      printf("%4.1f %4.0f\n", fahr, celsius);
      celsius = celsius + step;
    }
  }
#+end_src

#+RESULTS:
| Fahrenheit | celsius |
|       32.0 |       0 |
|       50.0 |      10 |
|       68.0 |      20 |
|       86.0 |      30 |
|      104.0 |      40 |
|      122.0 |      50 |
|      140.0 |      60 |
|      158.0 |      70 |
|      176.0 |      80 |
|      194.0 |      90 |
|      212.0 |     100 |


** 1.3

*** Exercise 1-5

Modify the temperature conversion program to print the table in reverse order, that is, from 300 degrees to 0.

#+begin_src C
  #include <stdio.h>

  /* print Fahrenheit-Celsius table */
  int main()
  {
    int fahr;

    for (fahr = 300; fahr >= 0; fahr = fahr - 20)
      printf("%3d %6.1f\n", fahr, (5.0/9.0)*(fahr-32));
  }
#+end_src

#+RESULTS:
| 300 | 148.9 |
| 280 | 137.8 |
| 260 | 126.7 |
| 240 | 115.6 |
| 220 | 104.4 |
| 200 |  93.3 |
| 180 |  82.2 |
| 160 |  71.1 |
| 140 |  60.0 |
| 120 |  48.9 |
| 100 |  37.8 |
|  80 |  26.7 |
|  60 |  15.6 |
|  40 |   4.4 |
|  20 |  -6.7 |
|   0 | -17.8 |
